# 6 数据载入、存储及文件格式

## 6.1 文本格式数据的读写

函数|描述
-|-
read_csv|
read_clipboard|从剪切板读取数据
read_excel|
read_html|
read_sas|
read_sql|
read_stata

In [1]:
!type examples\\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [2]:
import pandas as pd

df=pd.read_csv('examples\ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
!type examples\\ex2.txt

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
#不含表头

pd.read_csv('examples\ex2.txt',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [5]:
pd.read_csv('examples\ex2.txt',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
#将message列作为索引

names=['a','b','c','d','message']
pd.read_csv('examples\ex2.txt',names=names,index_col='message' )

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [7]:
!type examples\csv_mindex.csv

key1, key2,value1,value2
one, a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [8]:
parsed=pd.read_csv('examples\csv_mindex.csv',index_col=['key1',' key2'])   #注意key2前有一个空格
parsed

            value1  value2
key1  key2
one   a          1       2
     b           3       4
     c           5       6
     d           7       8
two  a           9      10
     b          11      12
     c          13      14
     d          15      16

In [9]:
parsed.index

MultiIndex(levels=[['one', 'two'], [' a', 'a', 'b', 'c', 'd']],
           codes=[[0, 0, 0, 0, 1, 1, 1, 1], [0, 2, 3, 4, 1, 2, 3, 4]],
           names=['key1', ' key2'])

In [10]:
list(open('examples\ex3.txt'))

['                 A         B            C\n',
 'aaa          -0.26    -1.03      -6.20\n',
 'bbb         0.93     0.30        -0.03\n',
 'ccc           -0.26    -0.39     -0.22\n',
 'ddd          -0.87     -0.35    1.10']

In [11]:
#检测到第一行少一列，因此其他列第一列自动作为索引

pd.read_csv('examples\ex3.txt',sep='\s+')

        A     B     C
aaa -0.26 -1.03 -6.20
bbb  0.93  0.30 -0.03
ccc -0.26 -0.39 -0.22
ddd -0.87 -0.35  1.10

In [12]:
list(open('examples\ex3_2.txt'))

['   Letter                 A         B            C\n',
 'aaa          -0.26    -1.03      -6.20\n',
 'bbb         0.93     0.30        -0.03\n',
 'ccc           -0.26    -0.39     -0.22\n',
 'ddd          -0.87     -0.35    1.10']

In [13]:
#检测到每一行列数相等，自动添加位置索引

pd.read_csv('examples\ex3_2.txt',sep='\s+')

  Letter     A     B     C
0    aaa -0.26 -1.03 -6.20
1    bbb  0.93  0.30 -0.03
2    ccc -0.26 -0.39 -0.22
3    ddd -0.87 -0.35  1.10

In [14]:
!type examples\ex4.txt

#嘿！
a,b,c,d,message
#只是为了让你觉得更难
#谁用计算机读取csv文件？
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [15]:
pd.read_csv('examples\ex4.txt',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
!type examples\ex5.txt

something,a, b,c,d,message
one,1,2,3.0,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [17]:
#识别缺失值，通过空字符串，NA,NULL

result=pd.read_csv('examples\ex5.txt')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [18]:
#使用缺失值标识

pd.read_csv('examples\ex5.txt',na_values=['NULL'])

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
sentinels={'message':'foo','something':'two'}

pd.read_csv('examples\ex5.txt',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

参数|描述
-|-
sep,delimiter|分隔符正则表达式
header|
index_col|作为索引的列，可以是分层索引
names|列名列表，与header=None连用
skiprows|从文件开头起，跳过的行数或行号列表
na_values|添加缺失值标识符，可以使用字典
nrows|从文件开头处读入的行数
chunksize|迭代块的大小
skip_footer|忽略文件尾部的行数
encoding|Unicode文本编码

### 6.1.1 分块读入文本文件

In [20]:
#首位各显示5行

pd.options.display.max_rows=10

### 6.1.2 将数据写入文本格式

In [21]:
data=pd.read_csv('examples\ex5.txt')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
data.to_csv('examples\out.csv')

In [23]:
!type examples\out.csv

,something,a, b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [24]:
data.to_csv('examples\out1.csv',sep='|')

In [25]:
!type examples\out1.csv

|something|a| b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [26]:
data.to_csv('examples\out2.csv',na_rep='NULL')

In [27]:
!type examples\out2.csv

,something,a, b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [28]:
#不写入行列

data.to_csv('examples\out3.csv',index=False,header=False)

!type examples\out3.csv

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [29]:
#写入子集

data.to_csv('examples\out4.csv',columns=['a','b','c'])

!type examples\out4.csv

C:\Users\liudonghang\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

,a,b,c
0,1,,3.0
1,5,,
2,9,,11.0

In [30]:
#Series的to_csv方法

import pandas as pd

dates=pd.date_range('1/1/2000', periods=7)

ts=pd.Series(range(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int64

### 6.1.3 使用分隔格式

In [31]:
!type examples\ex7.txt

"a","b","c"
"1","2","3"
"1","2","3"

In [32]:
import csv

f=open('examples\ex7.txt')

reader=csv.reader(f)

for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [33]:
with open('examples\ex7.txt') as f:
    lines=list(csv.reader(f))
    
header,values=lines[0],lines[1:]
data_dict={h:v for h,v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [34]:
with open('examples\out1.csv') as f:
    reader2=csv.reader(f,delimiter='|')
    for line in reader2:
        print(line)

['', 'something', 'a', ' b', 'c', 'd', 'message']
['0', 'one', '1', '2', '3.0', '4', '']
['1', 'two', '5', '6', '', '8', 'world']
['2', 'three', '9', '10', '11.0', '12', 'foo']

In [35]:
#定义一个csv的方言类
#使用csv.writer写入文件

class my_dialect(csv.Dialect):
    lineterminator='\n'
    delimiter=';'
    quotechar='"'
    quoting=csv.QUOTE_MINIMAL

with open('examples\mydata_mode_a.csv','a') as f:
    writer=csv.writer(f, dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [40]:
!type examples\mydata_mode_a.csv

one;two;three
1;2;3
4;5;6
7;8;9

### 6.1.5 XML和HTML:网络抓取

In [ ]:
pd.read_html

### 6.2.2 读取MS Excel文件

In [2]:
import pandas as pd
panel=pd.read_excel('examples\panel_data.xlsx')
panel.head()

,Region,Year,Lngdp,Hc,Urb,Lnk,Gz,Wz,Post,Tr,Post*Tr
0,Beijing,2017,11.767521,5.2912,0.865039,3.855569,8.828279,6.490417,1,1,1
1,Beijing,2016,11.680116,4.8883,0.865163,3.655725,8.765111,6.467384,1,1,1
2,Beijing,2015,11.575872,3.9200,0.864579,3.452782,8.654814,6.479458,1,1,1
3,Beijing,2014,11.512875,3.6057,0.863383,3.217579,8.417300,6.676553,1,1,1
4,Beijing,2013,11.457920,3.3337,0.862884,3.237381,8.336549,6.613921,0,1,0

In [7]:
panel.head().to_excel('examples\panel_head.xlsx', index=False)

# 7 数据清洗和准备

## 7.1 处理缺失数据

In [8]:
import pandas as pd
import numpy as np

string_data=pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [9]:
string_data.notna()

0     True
1     True
2    False
3     True
dtype: bool

### 7.1.1 滤除缺失值

In [10]:
data=pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data=pd.DataFrame([[1., 6.5, 3.],
                  [1., np.nan, np.nan],
                  [np.nan]*3,
                  [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4]=np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1]=np.nan
df.iloc[:2, 2]=np.nan
df

          0         1         2
0 -0.393156       NaN       NaN
1  0.937254       NaN       NaN
2  0.710737       NaN  0.493108
3  2.074531       NaN -0.466931
4 -0.010373  0.391662 -1.306495
5  0.086857  0.689099  0.628338
6 -0.874385 -0.522956 -1.340291

In [19]:
df.dropna()

          0         1         2
4 -0.010373  0.391662 -1.306495
5  0.086857  0.689099  0.628338
6 -0.874385 -0.522956 -1.340291

In [20]:
df.dropna(thresh=2)

          0         1         2
2  0.710737       NaN  0.493108
3  2.074531       NaN -0.466931
4 -0.010373  0.391662 -1.306495
5  0.086857  0.689099  0.628338
6 -0.874385 -0.522956 -1.340291

## 7.1.2 填充缺失数据

In [21]:
df.fillna(0)

          0         1         2
0 -0.393156  0.000000  0.000000
1  0.937254  0.000000  0.000000
2  0.710737  0.000000  0.493108
3  2.074531  0.000000 -0.466931
4 -0.010373  0.391662 -1.306495
5  0.086857  0.689099  0.628338
6 -0.874385 -0.522956 -1.340291

In [22]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.393156  0.500000  0.000000
1  0.937254  0.500000  0.000000
2  0.710737  0.500000  0.493108
3  2.074531  0.500000 -0.466931
4 -0.010373  0.391662 -1.306495
5  0.086857  0.689099  0.628338
6 -0.874385 -0.522956 -1.340291

In [23]:
df.fillna(0, inplace=True)
df

          0         1         2
0 -0.393156  0.000000  0.000000
1  0.937254  0.000000  0.000000
2  0.710737  0.000000  0.493108
3  2.074531  0.000000 -0.466931
4 -0.010373  0.391662 -1.306495
5  0.086857  0.689099  0.628338
6 -0.874385 -0.522956 -1.340291

In [24]:
df=pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1]=np.nan
df.iloc[4:, 2]=np.nan
df

          0         1         2
0  0.947093  1.672032 -2.156555
1  2.121360 -0.685114  0.301277
2 -0.239632       NaN -0.688944
3  1.312434       NaN  0.453392
4 -0.800168       NaN       NaN
5 -0.213997       NaN       NaN

In [25]:
df.fillna(method='ffill')

          0         1         2
0  0.947093  1.672032 -2.156555
1  2.121360 -0.685114  0.301277
2 -0.239632 -0.685114 -0.688944
3  1.312434 -0.685114  0.453392
4 -0.800168 -0.685114  0.453392
5 -0.213997 -0.685114  0.453392

In [26]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.947093  1.672032 -2.156555
1  2.121360 -0.685114  0.301277
2 -0.239632 -0.685114 -0.688944
3  1.312434 -0.685114  0.453392
4 -0.800168       NaN  0.453392
5 -0.213997       NaN  0.453392

In [28]:
data=pd.Series([1, np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2数据转换

### 7.2.1 移除重复数据

In [29]:
data=pd.DataFrame({'k1': ['one', 'two']*3+['two'],
                  'k2': [1,1,2,3,3,4,4,]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data.drop_duplicates(keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

### 7.2.2 利用函数或映射进行数据转换

In [40]:
data=pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon', 'Pastrami', 
                           'corned beef', 'Bacon',
                          'pastrami', 'honey ham', 'nova lox'],
                  'ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [41]:
meat_to_animal={'bacon': 'pig',
                'pulled pork': 'pig',
                'pastrami': 'cow',
                'corned beef': 'cow',
                'honey ham': 'pig',
                'nova lox': 'salmon'}

In [42]:
data.food.str.lower()

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [43]:
data['meat_to_animal']=data.food.str.lower().map(meat_to_animal)
data

          food  ounces meat_to_animal
0        bacon     4.0            pig
1  pulled pork     3.0            pig
2        bacon    12.0            pig
3     Pastrami     6.0            cow
4  corned beef     7.5            cow
5        Bacon     8.0            pig
6     pastrami     3.0            cow
7    honey ham     5.0            pig
8     nova lox     6.0         salmon

In [44]:
data.food.map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 7.2.3 替换值

In [46]:
data=pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [49]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 7.2.4 重命名轴索引

In [53]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                  index = ['Ohio', 'Colorado', 'New York'],
                  columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [56]:
data.index=data.index.map(lambda x: x[:4].upper())
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [57]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [58]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### 7.2.5 离散化和面元划分

In [65]:
ages=[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [66]:
bins=[18, 25, 35, 60, 100]

In [73]:
cats=pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [74]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [75]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [79]:
cats.value_counts()

[18, 25)     4
[25, 35)     4
[35, 60)     3
[60, 100)    1
dtype: int64

In [90]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [91]:
group_names=['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [92]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [100]:
#给出bins数量,得到等长bins
pd.cut(ages, 4, precision=2)

[(19.96, 30.25], (19.96, 30.25], (19.96, 30.25], (19.96, 30.25], (19.96, 30.25], ..., (30.25, 40.5], (50.75, 61.0], (40.5, 50.75], (40.5, 50.75], (30.25, 40.5]]
Length: 12
Categories (4, interval[float64]): [(19.96, 30.25] < (30.25, 40.5] < (40.5, 50.75] < (50.75, 61.0]]

In [106]:
data=np.random.randn(1000)
pd.qcut(data, 4, precision=2).value_counts()

(-3.0, -0.65]     250
(-0.65, 0.012]    250
(0.012, 0.69]     250
(0.69, 3.38]      250
dtype: int64

In [109]:
quantile=[0, 0.1, 0.5, 0.9, 1]
pd.qcut(data, quantile).value_counts()

(-2.995, -1.243]    100
(-1.243, 0.0119]    400
(0.0119, 1.281]     400
(1.281, 3.381]      100
dtype: int64

### 7.2.6 检测和过滤异常值

In [118]:
data=pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.018111    -0.045845     0.033567    -0.028913
std       1.017272     0.968446     0.961316     0.992338
min      -3.242528    -3.600982    -2.757548    -3.595846
25%      -0.703920    -0.718468    -0.634524    -0.675854
50%       0.089192    -0.037079     0.065727    -0.010769
75%       0.673536     0.627253     0.710668     0.587525
max       3.431548     3.248047     2.722668     3.359495

In [127]:
data_bool=np.abs(data)>3

In [128]:
data[data_bool.any(1)].head()

            0         1         2         3
44  -0.452091  0.830928 -0.282632 -3.285604
295  3.431548  0.829851 -1.148663 -0.619787
321 -1.449927  0.307091 -1.538447 -3.200704
375  0.419523  3.161920 -1.147120 -0.494439
398  0.596981 -3.203075  1.514477 -0.146918

In [142]:
data_bool.all(axis=0)

0    False
1    False
2    False
3    False
dtype: bool

In [143]:
data_bool.any()

0     True
1     True
2    False
3     True
dtype: bool

In [144]:
data[data_bool]=np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017922    -0.045432     0.033567    -0.028540
std       1.015163     0.964382     0.961316     0.986544
min      -3.000000    -3.000000    -2.757548    -3.000000
25%      -0.703920    -0.718468    -0.634524    -0.675854
50%       0.089192    -0.037079     0.065727    -0.010769
75%       0.673536     0.627253     0.710668     0.587525
max       3.000000     3.000000     2.722668     3.000000

### 7.2.7 排列和随机采样

In [145]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler=np.random.permutation(5)
sampler

array([4, 0, 3, 2, 1])

In [146]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [148]:
df.loc[sampler, :]

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [149]:
df.reindex(sampler)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [150]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [151]:
df.sample(n=3)

   0  1   2   3
0  0  1   2   3
2  8  9  10  11
1  4  5   6   7

In [154]:
choices=pd.Series([5, 7, -1, 6, 4])
draws=choices.sample(n=10, replace=True)
draws

4    4
2   -1
0    5
2   -1
1    7
3    6
0    5
1    7
2   -1
3    6
dtype: int64

In [155]:
draws.value_counts()

-1    3
 7    2
 6    2
 5    2
 4    1
dtype: int64

### 7.2.8 计算指标/哑变量

In [157]:
df=pd.DataFrame({'key': ['b', 'b', 'a','c','a','b'],
                 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [158]:
pd.get_dummies(df.key)

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [169]:
pd.get_dummies(data=df, columns=['key'], drop_first=True)

   data1  key_b  key_c
0      0      1      0
1      1      1      0
2      2      0      0
3      3      0      1
4      4      0      0
5      5      1      0

In [172]:
dummies=pd.get_dummies(df.key, prefix='key')
df[['data1']].join(dummies)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [173]:
df['data1']

0    0
1    1
2    2
3    3
4    4
5    5
Name: data1, dtype: int64

In [174]:
df[['data1']]

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [175]:
pd.get_dummies(df.key, drop_first=True)

   b  c
0  1  0
1  1  0
2  0  0
3  0  1
4  0  0
5  1  0

In [188]:
mnames=['movie_id', 'title', 'genre']
movies=pd.read_csv(r"D:\Github\pydata-book\datasets\movielens\movies.dat",
                   sep='::',
                   names=mnames)
movies.head()

C:\Users\liudonghang\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  after removing the cwd from sys.path.

   movie_id                               title                         genre
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [189]:
all_genre=[]
for x in movies.genre:
    all_genre.extend(x.split('|'))
genres=pd.unique(all_genre)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [191]:
set(all_genre)

{'Action',
 'Adventure',
 'Animation',
 "Children's",
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Fantasy',
 'Film-Noir',
 'Horror',
 'Musical',
 'Mystery',
 'Romance',
 'Sci-Fi',
 'Thriller',
 'War',
 'Western'}

In [199]:
zero_matrix=np.zeros((len(movies), len(genres)))
dummies=pd.DataFrame(zero_matrix, columns=genres)
dummies.columns.get_indexer(movies.genre[1].split('|'))

array([3, 1, 4], dtype=int64)

In [200]:
for i, gen in enumerate(movies.genre):
    indices=dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices]=1

In [203]:
movies_windic=movies.join(dummies)
movies_windic.loc[1]

movie_id                                  2
title                        Jumanji (1995)
genre          Adventure|Children's|Fantasy
Animation                                 0
Children's                                1
Comedy                                    0
Adventure                                 1
Fantasy                                   1
Romance                                   0
Drama                                     0
Action                                    0
Crime                                     0
Thriller                                  0
Horror                                    0
Sci-Fi                                    0
Documentary                               0
War                                       0
Musical                                   0
Mystery                                   0
Film-Noir                                 0
Western                                   0
Name: 1, dtype: object

In [219]:
np.random.seed(12345)
values=np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [220]:
bins=[0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 字符串操作

### 7.3.1 字符串对象方法

In [222]:
val='a,b,  guido'
pieces=[x.strip( )for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [227]:
first, second, third=pieces
first+'::'+second+'::'+'third'

'a::b::third'

In [228]:
'::'.join(pieces)

'a::b::guido'

In [229]:
val.index(',')

1

In [230]:
val.find(':')

-1

In [231]:
val.count(',')

2

In [237]:
val.replace(',', '::')

'a::b::  guido'

### 7.3.2 正则表达式

In [240]:
import re
text='foo  bar\t baz \tqux'
print(text)

foo  bar	 baz 	qux

In [241]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [245]:
regex=re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [247]:
regex.findall(text)

['  ', '\t ', ' \t']

In [248]:
re.findall('\s+', text)

['  ', '\t ', ' \t']

In [257]:
text="""Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern=r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [259]:
regex=re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [261]:
#search找到第一个模式
m=regex.search(text)
m

In [270]:
m.group()

'dave@google.com'

In [273]:
text[m.start():m.end()]

'dave@google.com'

In [275]:
#match只匹配字符串开头
print(regex.match(text))

None

In [277]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [280]:
list(regex.finditer(text))

[<re.Match object; span=(5, 20), match='dave@google.com'>,
 <re.Match object; span=(27, 42), match='steve@gmail.com'>,
 <re.Match object; span=(47, 60), match='rob@gmail.com'>,
 <re.Match object; span=(66, 80), match='ryan@yahoo.com'>]

In [286]:
text.startswith('D')

True

In [291]:
pattern=r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [292]:
regex=re.compile(pattern, flags=re.IGNORECASE)
m=regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [293]:
m.group()

'wesm@bright.net'

In [294]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [295]:
m

In [298]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### 7.3.3 pandas的矢量化字符串函数

In [299]:
data={'Dave': 'dava@google.com',
      'Steve': 'steve@gmail.com',
      'Rob': 'rob@gmail.com',
      'Wes': np.nan}
data=pd.Series(data)
data

Dave     dava@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [300]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [302]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [306]:
data.str.count('g')

Dave     2.0
Steve    1.0
Rob      1.0
Wes      NaN
dtype: float64

In [308]:
data.str.findall('g')

Dave     [g, g]
Steve       [g]
Rob         [g]
Wes         NaN
dtype: object

In [309]:
data.str.findall(pattern, re.IGNORECASE)

Dave     [(dava, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [314]:
data.str.get(0)

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [312]:
data.str[:5]

Dave     dava@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [322]:
data.str.match(pattern, flags=re.IGNORECASE)

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [320]:
data.str.match(r'[A-Z0-9._%+-]+@[A-Z0-9]+\.[A-Z]{2,4}', flags=re.IGNORECASE)

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [342]:
data.str.match(r'[A-R]', flags=re.IGNORECASE) #不区分正则表达式字母大小写

Dave      True
Steve    False
Rob       True
Wes        NaN
dtype: object

In [352]:
data.str.match('[a-z]')

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [353]:
data.str.match('[A-Z]')

Dave     False
Steve    False
Rob      False
Wes        NaN
dtype: object